# Руководство по GIT
Git — это набор консольных утилит, которые отслеживают и фиксируют изменения в файлах (чаще всего речь идет об исходном коде программ, но вы можете использовать его для любых файлов на ваш вкус). Изначально Git был создан Линусом Торвальдсом при разработке ядра Linux. Однако инструмент так понравился разработчикам, что в последствии, он получил широкое распространение и его стали использовать в других проектах. С его помощью вы можете сравнивать, анализировать, редактировать, сливать изменения и возвращаться назад к последнему сохранению. Этот процесс называется контролем версий.
## Тема 1. Команды GIT
1. init - инициализирует репазиторий.
2. status - показывает состояние репазиторий.
3. commit - сделать комментарий.
4. log - журнал.
5. checkout - переключение между различными версиями целевого объекта(файлами, коммитами, ветками).
6. add - добавляет содержимое рабочего каталога в индекс для последующего коммита.
## Тема 2. Ветки  
### Команды, для работы с ветками
* _git branch_ - выводит список веток.
* _git branch <имя ветки>_ - создает новую ветку.
* _git checkout <имя ветки>_ - переключает пользователя на другую ветку. 
* _git checkout <ключ> <имя ветки>_ - создает новую ветку и сразу переключается на нее. 
* _git merge_ - cливает изменения с переданной ветки в текущую.
## 3. Работа с удаленными репозиториями
### Команды, для работы с удаленными репозиториями
* _git clone_ - загружает все изменения и позволяет слить все ветки на локальном компьютере и в удаленном репозитории.
* _git pull_ - позволяет скачать все из текущего репозитория и автоматически сделать слияние с нашей версией.
* _git push_ - позволяет отправить нашу версию репозитория на внешний репозиторий. Требует авторизации на внешнем репозитории.
* _pull request_ - команда для предложения изменений, запрос на вливание изменений в репозиторий.
### Как сделать pull request
* Делаем (ответвление) fork репозитория
* Делаем git clone СВОЕЙ версии репозитория
* Создаем новую ветку и в НЕЕ вносим свои изменения
* Фиксируем изменения (делаем коммиты)
* Отправляем свою версию в свой GitHub
* На сайте GitHub нажимаем кнопку pull reques